; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-6-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-4 - location
	p0-5 - location
	p1-2 - location
	p1-3 - location
	p1-5 - location
	p1-7 - location
	p3-6 - location
	p4-0 - location
	p4-5 - location
	p4-6 - location
	p6-2 - location
	p6-5 - location
	p7-2 - location
	p7-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s0)
	(at driver3 s7)
	(at truck1 s7)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s5)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s4)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s1)
	(at package2 s7)
	(at package3 s4)
	(at package4 s6)
	(at package5 s7)
	(at package6 s1)
	(at package7 s2)
	(at package8 s0)
	(at package9 s6)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s7 p7-2)
	(path p7-2 s7)
	(path s2 p7-2)
	(path p7-2 s2)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 32)
	(= (time-to-drive s1 s0) 32)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 39)
	(= (time-to-drive s2 s0) 39)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 79)
	(= (time-to-drive s5 s0) 79)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 67)
	(= (time-to-drive s7 s0) 67)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 4)
	(= (time-to-drive s6 s1) 4)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 15)
	(= (time-to-drive s1 s2) 15)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 53)
	(= (time-to-drive s3 s2) 53)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 83)
	(= (time-to-drive s4 s2) 83)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 18)
	(= (time-to-drive s0 s3) 18)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 49)
	(= (time-to-drive s1 s3) 49)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 51)
	(= (time-to-drive s7 s3) 51)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 28)
	(= (time-to-drive s5 s4) 28)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 6)
	(= (time-to-drive s1 s5) 6)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 73)
	(= (time-to-drive s0 s6) 73)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 54)
	(= (time-to-drive s5 s6) 54)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 49)
	(= (time-to-drive s7 s6) 49)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 78)
	(= (time-to-drive s1 s7) 78)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 90)
	(= (time-to-drive s5 s7) 90)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s4)
	(at truck3 s7)
	(at truck4 s3)
	(at truck5 s7)
	(at truck6 s3)
	(at package1 s5)
	(at package2 s0)
	(at package3 s1)
	(at package4 s0)
	(at package5 s0)
	(at package6 s0)
	(at package7 s3)
	(at package8 s3)
	(at package9 s0)
	))

(:metric minimize (+ (* 3 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 0 of 14
2. (walk driver3 s7 p7-2)
   deleted: (at driver3 s7)
   added: (at driver3 p7-2)
   goals met: 0 of 14
3. (walk driver3 p7-2 s2)
   deleted: (at driver3 p7-2)
   added: (at driver3 s2)
   goals met: 0 of 14
4. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 0 of 14
5. (load-truck package7 truck3 s2)
   deleted: (at package7 s2)
   added: (in package7 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 0 of 14
6. (drive-truck truck4 s0 s6 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   changed: (fuel-used) from 0 to 730
   goals met: 0 of 14
7. (load-truck package4 truck4 s6)
   deleted: (at package4 s6)
   added: (in package4 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 0 of 14
8. (drive-truck truck4 s6 s5 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s5)
   changed: (fuel-used) from 730 to 1324
   goals met: 0 of 14
9. (drive-truck truck3 s2 s4 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 1324 to 2237
   goals met: 0 of 14
10. (walk driver1 s3 p3-6)
   deleted: (at driver1 s3)
   added: (at driver1 p3-6)
   goals met: 0 of 14
11. (walk driver1 p3-6 s6)
   deleted: (at driver1 p3-6)
   added: (at driver1 s6)
   goals met: 0 of 14
12. (drive-truck truck3 s4 s5 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 2237 to 2545
   goals met: 0 of 14
13. (walk driver1 s6 p4-6)
   deleted: (at driver1 s6)
   added: (at driver1 p4-6)
   goals met: 0 of 14
14. (drive-truck truck3 s5 s7 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (fuel-used) from 2545 to 3535
   goals met: 1 of 14
15. (load-truck package5 truck3 s7)
   deleted: (at package5 s7)
   added: (in package5 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 1 of 14
16. (walk driver1 p4-6 s4)
   deleted: (at driver1 p4-6)
   added: (at driver1 s4)
   goals met: 2 of 14
17. (load-truck package2 truck3 s7)
   deleted: (at package2 s7)
   added: (in package2 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 2 of 14
18. (board-truck driver1 truck6 s4)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 1 of 14
19. (drive-truck truck3 s7 s3 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s3)
   changed: (fuel-used) from 3535 to 4351
   goals met: 0 of 14
20. (unload-truck package7 truck3 s3)
   deleted: (in package7 truck3)
   added: (at package7 s3)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 1 of 14
21. (drive-truck truck4 s5 s0 driver2)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   changed: (fuel-used) from 4351 to 5220
   goals met: 1 of 14
22. (unload-truck package4 truck4 s0)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 2 of 14
23. (drive-truck truck3 s3 s7 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   changed: (fuel-used) from 5220 to 5883
   goals met: 3 of 14
24. (load-truck package8 truck4 s0)
   deleted: (at package8 s0)
   added: (in package8 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 3 of 14
25. (load-truck package3 truck6 s4)
   deleted: (at package3 s4)
   added: (in package3 truck6)
   changed: (load truck6) from 0 to 1, (fuel-per-minute truck6) from 10 to 11
   goals met: 3 of 14
26. (drive-truck truck6 s4 s5 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   changed: (fuel-used) from 5883 to 6191
   goals met: 3 of 14
27. (drive-truck truck4 s0 s3 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   changed: (fuel-used) from 6191 to 6389
   goals met: 4 of 14
28. (unload-truck package8 truck4 s3)
   deleted: (in package8 truck4)
   added: (at package8 s3)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 5 of 14
29. (drive-truck truck3 s7 s0 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   changed: (fuel-used) from 6389 to 7260
   goals met: 4 of 14
30. (unload-truck package2 truck3 s0)
   deleted: (in package2 truck3)
   added: (at package2 s0)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 5 of 14
31. (unload-truck package5 truck3 s0)
   deleted: (in package5 truck3)
   added: (at package5 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 14
32. (drive-truck truck6 s5 s4 driver1)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   changed: (fuel-used) from 7260 to 7568
   goals met: 6 of 14
33. (drive-truck truck3 s0 s1 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 7568 to 7888
   goals met: 6 of 14
34. (load-truck package6 truck3 s1)
   deleted: (at package6 s1)
   added: (in package6 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 14
35. (drive-truck truck6 s4 s2 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   changed: (fuel-used) from 7888 to 8801
   goals met: 6 of 14
36. (load-truck package1 truck3 s1)
   deleted: (at package1 s1)
   added: (in package1 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 6 of 14
37. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 8801 to 9217
   goals met: 6 of 14
38. (unload-truck package6 truck3 s0)
   deleted: (in package6 truck3)
   added: (at package6 s0)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 7 of 14
39. (drive-truck truck3 s0 s5 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   changed: (fuel-used) from 9217 to 10086
   goals met: 7 of 14
40. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 14
41. (drive-truck truck3 s5 s6 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s6)
   changed: (fuel-used) from 10086 to 10626
   goals met: 8 of 14
42. (load-truck package9 truck3 s6)
   deleted: (at package9 s6)
   added: (in package9 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 8 of 14
43. (drive-truck truck3 s6 s0 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   changed: (fuel-used) from 10626 to 11429
   goals met: 8 of 14
44. (unload-truck package9 truck3 s0)
   deleted: (in package9 truck3)
   added: (at package9 s0)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 9 of 14
45. (drive-truck truck3 s0 s7 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   changed: (fuel-used) from 11429 to 12099
   goals met: 10 of 14
46. (drive-truck truck6 s2 s4 driver1)
   deleted: (at truck6 s2)
   added: (at truck6 s4)
   changed: (fuel-used) from 12099 to 13012
   goals met: 10 of 14
47. (drive-truck truck6 s4 s5 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   changed: (fuel-used) from 13012 to 13320
   goals met: 10 of 14
48. (disembark-truck driver1 truck6 s5)
   deleted: (driving driver1 truck6)
   added: (at driver1 s5) (empty truck6)
   goals met: 10 of 14
49. (unload-truck package3 truck6 s5)
   deleted: (in package3 truck6)
   added: (at package3 s5)
   changed: (load truck6) from 1 to 0, (fuel-per-minute truck6) from 11 to 10
   goals met: 10 of 14
50. (board-truck driver1 truck6 s5)
   deleted: (at driver1 s5) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 10 of 14
51. (drive-truck truck6 s5 s4 driver1)
   deleted: (at truck6 s5)
   added: (at truck6 s4)
   changed: (fuel-used) from 13320 to 13600
   goals met: 10 of 14
52. (drive-truck truck3 s7 s5 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (fuel-used) from 13600 to 14500
   goals met: 9 of 14
53. (load-truck package3 truck3 s5)
   deleted: (at package3 s5)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 9 of 14
54. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   changed: (fuel-used) from 14500 to 14566
   goals met: 9 of 14
55. (unload-truck package3 truck3 s1)
   deleted: (in package3 truck3)
   added: (at package3 s1)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 10 of 14
56. (drive-truck truck3 s1 s5 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   changed: (fuel-used) from 14566 to 14626
   goals met: 10 of 14
57. (disembark-truck driver3 truck3 s5)
   deleted: (driving driver3 truck3)
   added: (at driver3 s5) (empty truck3)
   goals met: 10 of 14
58. (board-truck driver3 truck5 s5)
   deleted: (at driver3 s5) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 10 of 14
59. (drive-truck truck5 s5 s7 driver3)
   deleted: (at truck5 s5)
   added: (at truck5 s7)
   changed: (fuel-used) from 14626 to 15526
   goals met: 11 of 14
60. (drive-truck truck6 s4 s5 driver1)
   deleted: (at truck6 s4)
   added: (at truck6 s5)
   changed: (fuel-used) from 15526 to 15806
   goals met: 11 of 14
61. (drive-truck truck6 s5 s7 driver1)
   deleted: (at truck6 s5)
   added: (at truck6 s7)
   changed: (fuel-used) from 15806 to 16706
   goals met: 11 of 14
62. (disembark-truck driver1 truck6 s7)
   deleted: (driving driver1 truck6)
   added: (at driver1 s7) (empty truck6)
   goals met: 11 of 14
63. (walk driver1 s7 p7-4)
   deleted: (at driver1 s7)
   added: (at driver1 p7-4)
   goals met: 11 of 14
64. (walk driver1 p7-4 s4)
   deleted: (at driver1 p7-4)
   added: (at driver1 s4)
   goals met: 12 of 14
65. (disembark-truck driver3 truck5 s7)
   deleted: (driving driver3 truck5)
   added: (at driver3 s7) (empty truck5)
   goals met: 12 of 14
66. (board-truck driver3 truck6 s7)
   deleted: (at driver3 s7) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 12 of 14
67. (drive-truck truck6 s7 s3 driver3)
   deleted: (at truck6 s7)
   added: (at truck6 s3)
   changed: (fuel-used) from 16706 to 17216
   goals met: 13 of 14
68. (walk driver1 s4 p4-5)
   deleted: (at driver1 s4)
   added: (at driver1 p4-5)
   goals met: 12 of 14
69. (walk driver1 p4-5 s5)
   deleted: (at driver1 p4-5)
   added: (at driver1 s5)
   goals met: 12 of 14
70. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 12 of 14
71. (drive-truck truck3 s5 s7 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (fuel-used) from 17216 to 18116
   goals met: 13 of 14
72. (disembark-truck driver1 truck3 s7)
   deleted: (driving driver1 truck3)
   added: (at driver1 s7) (empty truck3)
   goals met: 13 of 14
73. (walk driver1 s7 p7-4)
   deleted: (at driver1 s7)
   added: (at driver1 p7-4)
   goals met: 13 of 14
74. (walk driver1 p7-4 s4)
   deleted: (at driver1 p7-4)
   added: (at driver1 s4)
   goals met: 14 of 14
